Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/component/osc32kctrl.h
/*
 * Component description for OSC32KCTRL
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-11-28T06:55:10Z */
#ifndef _PIC32CKSG01_OSC32KCTRL_COMPONENT_H_
#define _PIC32CKSG01_OSC32KCTRL_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR OSC32KCTRL                                   */
/* ************************************************************************** */

/* -------- OSC32KCTRL_CFDCTRL : (OSC32KCTRL Offset: 0x14) (R/W 32) Clock Failure Detector Control -------- */
#define OSC32KCTRL_CFDCTRL_RESETVALUE         _UINT32_(0x00)                                       /*  (OSC32KCTRL_CFDCTRL) Clock Failure Detector Control  Reset Value */

#define OSC32KCTRL_CFDCTRL_CFDEN_Pos          _UINT32_(0)                                          /* (OSC32KCTRL_CFDCTRL) Clock Failure Detector Enable Position */
#define OSC32KCTRL_CFDCTRL_CFDEN_Msk          (_UINT32_(0x1) << OSC32KCTRL_CFDCTRL_CFDEN_Pos)      /* (OSC32KCTRL_CFDCTRL) Clock Failure Detector Enable Mask */
#define OSC32KCTRL_CFDCTRL_CFDEN(value)       (OSC32KCTRL_CFDCTRL_CFDEN_Msk & (_UINT32_(value) << OSC32KCTRL_CFDCTRL_CFDEN_Pos)) /* Assigment of value for CFDEN in the OSC32KCTRL_CFDCTRL register */
#define OSC32KCTRL_CFDCTRL_SWBACK_Pos         _UINT32_(1)                                          /* (OSC32KCTRL_CFDCTRL) Clock Switch Back Position */
#define OSC32KCTRL_CFDCTRL_SWBACK_Msk         (_UINT32_(0x1) << OSC32KCTRL_CFDCTRL_SWBACK_Pos)     /* (OSC32KCTRL_CFDCTRL) Clock Switch Back Mask */
#define OSC32KCTRL_CFDCTRL_SWBACK(value)      (OSC32KCTRL_CFDCTRL_SWBACK_Msk & (_UINT32_(value) << OSC32KCTRL_CFDCTRL_SWBACK_Pos)) /* Assigment of value for SWBACK in the OSC32KCTRL_CFDCTRL register */
#define OSC32KCTRL_CFDCTRL_CFDPRESC_Pos       _UINT32_(2)                                          /* (OSC32KCTRL_CFDCTRL) Clock Failure Detector Prescaler Position */
#define OSC32KCTRL_CFDCTRL_CFDPRESC_Msk       (_UINT32_(0x1) << OSC32KCTRL_CFDCTRL_CFDPRESC_Pos)   /* (OSC32KCTRL_CFDCTRL) Clock Failure Detector Prescaler Mask */
#define OSC32KCTRL_CFDCTRL_CFDPRESC(value)    (OSC32KCTRL_CFDCTRL_CFDPRESC_Msk & (_UINT32_(value) << OSC32KCTRL_CFDCTRL_CFDPRESC_Pos)) /* Assigment of value for CFDPRESC in the OSC32KCTRL_CFDCTRL register */
#define OSC32KCTRL_CFDCTRL_Msk                _UINT32_(0x00000007)                                 /* (OSC32KCTRL_CFDCTRL) Register Mask  */


/* -------- OSC32KCTRL_CLKSELCTRL : (OSC32KCTRL Offset: 0x10) (R/W 32) Clock Selection Control -------- */
#define OSC32KCTRL_CLKSELCTRL_RESETVALUE      _UINT32_(0x00)                                       /*  (OSC32KCTRL_CLKSELCTRL) Clock Selection Control  Reset Value */

#define OSC32KCTRL_CLKSELCTRL_RTCSEL_Pos      _UINT32_(0)                                          /* (OSC32KCTRL_CLKSELCTRL) RTC Clock Selection Position */
#define OSC32KCTRL_CLKSELCTRL_RTCSEL_Msk      (_UINT32_(0x3) << OSC32KCTRL_CLKSELCTRL_RTCSEL_Pos)  /* (OSC32KCTRL_CLKSELCTRL) RTC Clock Selection Mask */
#define OSC32KCTRL_CLKSELCTRL_RTCSEL(value)   (OSC32KCTRL_CLKSELCTRL_RTCSEL_Msk & (_UINT32_(value) << OSC32KCTRL_CLKSELCTRL_RTCSEL_Pos)) /* Assigment of value for RTCSEL in the OSC32KCTRL_CLKSELCTRL register */
#define   OSC32KCTRL_CLKSELCTRL_RTCSEL_ULP32K_Val _UINT32_(0x0)                                        /* (OSC32KCTRL_CLKSELCTRL) 32.768kHz from 32kHz internal ULP oscillator  */
#define   OSC32KCTRL_CLKSELCTRL_RTCSEL_ULP1K_Val _UINT32_(0x1)                                        /* (OSC32KCTRL_CLKSELCTRL) 1.024kHz from 32kHz internal ULP oscillator  */
#define   OSC32KCTRL_CLKSELCTRL_RTCSEL_XOSC32K_Val _UINT32_(0x2)                                        /* (OSC32KCTRL_CLKSELCTRL) 32.768kHz from 32.768kHz external crystal oscillator  */
#define   OSC32KCTRL_CLKSELCTRL_RTCSEL_XOSC1K_Val _UINT32_(0x3)                                        /* (OSC32KCTRL_CLKSELCTRL) 1.024kHz from 32.768kHz internal oscillator  */
#define OSC32KCTRL_CLKSELCTRL_RTCSEL_ULP32K   (OSC32KCTRL_CLKSELCTRL_RTCSEL_ULP32K_Val << OSC32KCTRL_CLKSELCTRL_RTCSEL_Pos) /* (OSC32KCTRL_CLKSELCTRL) 32.768kHz from 32kHz internal ULP oscillator Position  */
#define OSC32KCTRL_CLKSELCTRL_RTCSEL_ULP1K    (OSC32KCTRL_CLKSELCTRL_RTCSEL_ULP1K_Val << OSC32KCTRL_CLKSELCTRL_RTCSEL_Pos) /* (OSC32KCTRL_CLKSELCTRL) 1.024kHz from 32kHz internal ULP oscillator Position  */
#define OSC32KCTRL_CLKSELCTRL_RTCSEL_XOSC32K  (OSC32KCTRL_CLKSELCTRL_RTCSEL_XOSC32K_Val << OSC32KCTRL_CLKSELCTRL_RTCSEL_Pos) /* (OSC32KCTRL_CLKSELCTRL) 32.768kHz from 32.768kHz external crystal oscillator Position  */
#define OSC32KCTRL_CLKSELCTRL_RTCSEL_XOSC1K   (OSC32KCTRL_CLKSELCTRL_RTCSEL_XOSC1K_Val << OSC32KCTRL_CLKSELCTRL_RTCSEL_Pos) /* (OSC32KCTRL_CLKSELCTRL) 1.024kHz from 32.768kHz internal oscillator Position  */
#define OSC32KCTRL_CLKSELCTRL_HSMSEL_Pos      _UINT32_(4)                                          /* (OSC32KCTRL_CLKSELCTRL) HSM Clock Selection Position */
#define OSC32KCTRL_CLKSELCTRL_HSMSEL_Msk      (_UINT32_(0x3) << OSC32KCTRL_CLKSELCTRL_HSMSEL_Pos)  /* (OSC32KCTRL_CLKSELCTRL) HSM Clock Selection Mask */
#define OSC32KCTRL_CLKSELCTRL_HSMSEL(value)   (OSC32KCTRL_CLKSELCTRL_HSMSEL_Msk & (_UINT32_(value) << OSC32KCTRL_CLKSELCTRL_HSMSEL_Pos)) /* Assigment of value for HSMSEL in the OSC32KCTRL_CLKSELCTRL register */
#define   OSC32KCTRL_CLKSELCTRL_HSMSEL_ULP32K_Val _UINT32_(0x0)                                        /* (OSC32KCTRL_CLKSELCTRL) 32.768kHz from 32kHz internal ULP oscillator  */
#define   OSC32KCTRL_CLKSELCTRL_HSMSEL_XOSC32K_Val _UINT32_(0x2)                                        /* (OSC32KCTRL_CLKSELCTRL) 32.768kHz from 32.768kHz external crystal oscillator  */
#define OSC32KCTRL_CLKSELCTRL_HSMSEL_ULP32K   (OSC32KCTRL_CLKSELCTRL_HSMSEL_ULP32K_Val << OSC32KCTRL_CLKSELCTRL_HSMSEL_Pos) /* (OSC32KCTRL_CLKSELCTRL) 32.768kHz from 32kHz internal ULP oscillator Position  */
#define OSC32KCTRL_CLKSELCTRL_HSMSEL_XOSC32K  (OSC32KCTRL_CLKSELCTRL_HSMSEL_XOSC32K_Val << OSC32KCTRL_CLKSELCTRL_HSMSEL_Pos) /* (OSC32KCTRL_CLKSELCTRL) 32.768kHz from 32.768kHz external crystal oscillator Position  */
#define OSC32KCTRL_CLKSELCTRL_Msk             _UINT32_(0x00000033)                                 /* (OSC32KCTRL_CLKSELCTRL) Register Mask  */


/* -------- OSC32KCTRL_EVCTRL : (OSC32KCTRL Offset: 0x18) (R/W 32) Event Control -------- */
#define OSC32KCTRL_EVCTRL_RESETVALUE          _UINT32_(0x00)                                       /*  (OSC32KCTRL_EVCTRL) Event Control  Reset Value */

#define OSC32KCTRL_EVCTRL_CFDEO_Pos           _UINT32_(0)                                          /* (OSC32KCTRL_EVCTRL) Clock Failure Detector Event Output Enable Position */
#define OSC32KCTRL_EVCTRL_CFDEO_Msk           (_UINT32_(0x1) << OSC32KCTRL_EVCTRL_CFDEO_Pos)       /* (OSC32KCTRL_EVCTRL) Clock Failure Detector Event Output Enable Mask */
#define OSC32KCTRL_EVCTRL_CFDEO(value)        (OSC32KCTRL_EVCTRL_CFDEO_Msk & (_UINT32_(value) << OSC32KCTRL_EVCTRL_CFDEO_Pos)) /* Assigment of value for CFDEO in the OSC32KCTRL_EVCTRL register */
#define OSC32KCTRL_EVCTRL_Msk                 _UINT32_(0x00000001)                                 /* (OSC32KCTRL_EVCTRL) Register Mask  */


/* -------- OSC32KCTRL_INTENCLR : (OSC32KCTRL Offset: 0x00) (R/W 32) Interrupt Enable Clear -------- */
#define OSC32KCTRL_INTENCLR_RESETVALUE        _UINT32_(0x00)                                       /*  (OSC32KCTRL_INTENCLR) Interrupt Enable Clear  Reset Value */

#define OSC32KCTRL_INTENCLR_XOSC32KRDY_Pos    _UINT32_(0)                                          /* (OSC32KCTRL_INTENCLR) XOSC32K Ready Interrupt Enable Position */
#define OSC32KCTRL_INTENCLR_XOSC32KRDY_Msk    (_UINT32_(0x1) << OSC32KCTRL_INTENCLR_XOSC32KRDY_Pos) /* (OSC32KCTRL_INTENCLR) XOSC32K Ready Interrupt Enable Mask */
#define OSC32KCTRL_INTENCLR_XOSC32KRDY(value) (OSC32KCTRL_INTENCLR_XOSC32KRDY_Msk & (_UINT32_(value) << OSC32KCTRL_INTENCLR_XOSC32KRDY_Pos)) /* Assigment of value for XOSC32KRDY in the OSC32KCTRL_INTENCLR register */
#define OSC32KCTRL_INTENCLR_XOSC32KFAIL_Pos   _UINT32_(2)                                          /* (OSC32KCTRL_INTENCLR) XOSC32K Clock Failure Detector Interrupt Enable Position */
#define OSC32KCTRL_INTENCLR_XOSC32KFAIL_Msk   (_UINT32_(0x1) << OSC32KCTRL_INTENCLR_XOSC32KFAIL_Pos) /* (OSC32KCTRL_INTENCLR) XOSC32K Clock Failure Detector Interrupt Enable Mask */
#define OSC32KCTRL_INTENCLR_XOSC32KFAIL(value) (OSC32KCTRL_INTENCLR_XOSC32KFAIL_Msk & (_UINT32_(value) << OSC32KCTRL_INTENCLR_XOSC32KFAIL_Pos)) /* Assigment of value for XOSC32KFAIL in the OSC32KCTRL_INTENCLR register */
#define OSC32KCTRL_INTENCLR_Msk               _UINT32_(0x00000005)                                 /* (OSC32KCTRL_INTENCLR) Register Mask  */


